ERP DEV.WMS/src/Reports/вмс_ОтчетПоОбеспечениюЗаказов/вмс_ОтчетПоОбеспечениюЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>вмс_ОтчетПоОбеспечениюЗаказов</name>
</mdclass:Report>

ERP DEV.WMS/src/Documents/вмс_ЗаданиеКладовщику/вмс_ЗаданиеКладовщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вмс_ЗаданиеКладовщику</name>
  <registerRecords>InformationRegister.вмс_ЗадачиКладовщиков</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ЗаданияКладовщикам</registerRecords>
  <registerRecords>AccumulationRegister.вмс_ОперацияПоЯчейкам</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>CatalogRef.вмс_Операции</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЗадание</name>
    <type>
      <types>DocumentRef.вмс_ЗаданиеКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.вмс_НастройкиОператора</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПримечаниеСкладу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.вмс_СостоянияЗаявокКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтправитель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаПолучатель</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьКонтейнеры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.вмс_МестаХранения</types>
      <types>String</types>
      <types>Number</types>
      <types>CatalogRef.вмс_КлючиАналитики</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоНастройкаПолей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Правило</name>
    <type>
      <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
    </type>
  </attributes>
  <attributes>
    <name>УправляющееЗадание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Инвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КачествоПоУмолчанию</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВводаСерии</name>
      <type>
        <types>EnumRef.вмс_СпособВводаСерии</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБазовыхЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаТранзит</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПриемник</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияКонтейнеров</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.вмс_Помещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныеЯчейки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПересчетКонтейнераРодителя</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <comment>Хранит фактически отсканированную маркировку товара</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолныйКодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <comment>Партионный учет</comment>
      <type>
        <types>CatalogRef.вмс_ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АгрегацияКонтейнеров</name>
    <comment>Используется для сборки\разборки товаров в контейнеры</comment>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетныйПараметр1</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>УчетныйПараметр2</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Маркировка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыПоИнвентаризации</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Контейнер</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>Characteristic.вмс_СоответствиеМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.вмс_СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.вмс_КачествоТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУчет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.вмс_МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерПриемник</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
    <attributes>
      <name>КонтейнерОтправитель</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкаПолейСтрок</name>
    <comment>Индивидуальные настройки полей для строк задания</comment>
    <attributes>
      <name>ИдентификаторИнструкции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСвойства</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP DEV.WMS/src/Reports/вмс_ОтчетПоОбеспечениюЗаказов/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
	
	ТаблицаРаспоряжений = ПолучитьТаблицуРаспоряжений();
	
	ПолучитьДанныеЗаданий(ТаблицаРаспоряжений);
	
	ТаблицаРезультата = ПолучитьТаблицуРезультата(ТаблицаРаспоряжений);
	
	ВывестиТаблицуРезультата(ТаблицаРезультата, ДокументРезультат, ДанныеРасшифровки);
	
КонецПроцедуры

Функция ПолучитьТаблицуРаспоряжений()

	ОсновнаяСхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = КомпоновщикНастроек.Настройки;
	СхемаКомпоновкиДанныхРаспоряжений = Новый СхемаКомпоновкиДанных;
	ИсточникДанных = СхемаКомпоновкиДанныхРаспоряжений.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.СтрокаСоединения = "localhost";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных0 = ОсновнаяСхемаКомпоновкиДанных.НаборыДанных.Найти("Распоряжения");
	НаборДанных = СхемаКомпоновкиДанныхРаспоряжений.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	ЗаполнитьЗначенияСвойств(НаборДанных, НаборДанных0, "Имя, Запрос, ИсточникДанных");
	
    ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям = СхемаКомпоновкиДанныхРаспоряжений.Параметры.Добавить();
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.Имя = "ИспользоватьДанныеЗапросаПоРаспоряжениям";
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.ОграничениеИспользования = Истина;
	ПараметрыИспользоватьДанныеЗапросаПоРаспоряжениям.Значение = Истина;
	
	НастройкиРаспоряжений = СхемаКомпоновкиДанныхРаспоряжений.НастройкиПоУмолчанию;
	РаботаССКД.СкопироватьЭлементы(НастройкиРаспоряжений.Отбор, Настройки.Отбор);
	РаботаССКД.УстановитьНастройкуВыводаВсехПолей(СхемаКомпоновкиДанныхРаспоряжений, НастройкиРаспоряжений);
	РаботаССКД.УстановитьНастройкиДляПолученияКоллекцииЗначений(НастройкиРаспоряжений);
	
	КомпоновщикНастроекРаспоряжений = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРаспоряжений.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанныхРаспоряжений));
	КомпоновщикНастроекРаспоряжений.ЗагрузитьНастройки(НастройкиРаспоряжений);
	КомпоновщикНастроекРаспоряжений.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиРаспоряжений = КомпоновщикНастроекРаспоряжений.Настройки;
	
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиРаспоряжений = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанныхРаспоряжений, НастройкиРаспоряжений, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиРаспоряжений, , , Истина);
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаРаспоряжений = ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Возврат ТаблицаРаспоряжений;
	
КонецФункции

Функция ПолучитьДанныеЗаданий(ТаблицаРаспоряжений)
	
	ТаблицаРаспоряжений.Колонки.Добавить("ЗаданиеОбъект");
	
	РассчитатьОстаткиПоЗаданиям = Новый Массив;
	
	Для Каждого ЭлементТаблицыРаспоряжений Из ТаблицаРаспоряжений Цикл
		ЗаданиеОбъект = ЭлементТаблицыРаспоряжений.Задание.ПолучитьОбъект();
		ЗаданиеОбъект.Прочитать();
		ЭлементТаблицыРаспоряжений.ЗаданиеОбъект = ЗаданиеОбъект;
		Если НЕ ЭлементТаблицыРаспоряжений.ОстаткиПодобраны Тогда
			РассчитатьОстаткиПоЗаданиям.Добавить(ЗаданиеОбъект);
		КонецЕсли;
	КонецЦикла;
	
	Если РассчитатьОстаткиПоЗаданиям.Количество() > 0 Тогда
		Документы.вмс_ЗаданиеКладовщику.ПодобратьЯчейкиОтправители(РассчитатьОстаткиПоЗаданиям);
	КонецЕсли;
	
КонецФункции

Функция ПолучитьТаблицуРезультата(ТаблицаРаспоряжений)
	
	ТаблицаРезультата = Новый ТаблицаЗначений;
	ТаблицаРезультата.Колонки.Добавить("Распоряжение");
	ТаблицаРезультата.Колонки.Добавить("Номенклатура");
	ТаблицаРезультата.Колонки.Добавить("Характеристика");
	ТаблицаРезультата.Колонки.Добавить("Серия");
	ТаблицаРезультата.Колонки.Добавить("КоличествоЗаказано");
	ТаблицаРезультата.Колонки.Добавить("КоличествоОбеспечено");
	
	ПустаяЯчейка = Справочники.вмс_МестаХранения.ПустаяСсылка();
	
	Для Каждого ЭлементТаблицыРаспоряжений Из ТаблицаРаспоряжений Цикл
		ЗаданиеОбъект = ЭлементТаблицыРаспоряжений.ЗаданиеОбъект;
		Для Каждого ЭлементТовара Из ЗаданиеОбъект.Товары Цикл
			ЭлементРезультат = ТаблицаРезультата.Добавить();
			ЭлементРезультат.Распоряжение = ЗаданиеОбъект.Распоряжение;
			ЗаполнитьЗначенияСвойств(ЭлементРезультат, ЭлементТовара);
			ЭлементРезультат.КоличествоЗаказано = ЭлементТовара.Количество;
			ЭлементРезультат.КоличествоОбеспечено = ?(ЭлементТовара.Ячейка <> ПустаяЯчейка, ЭлементТовара.Количество, 0);
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаРезультата.Свернуть("Распоряжение, Номенклатура, Характеристика, Серия", "КоличествоЗаказано, КоличествоОбеспечено");
	
	Возврат ТаблицаРезультата;
	
КонецФункции

Функция ВывестиТаблицуРезультата(ТаблицаРезультата, ДокументРезультат, ДанныеРасшифровки)

	СхемаКомпоновкиРезультат = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	НаборДанныхРаспоряжения = СхемаКомпоновкиРезультат.НаборыДанных.Найти("Распоряжения");
	СхемаКомпоновкиРезультат.НаборыДанных.Удалить(НаборДанныхРаспоряжения);

	КомпоновщикНастроекРезультата = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРезультата.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиРезультат));
	КомпоновщикНастроекРезультата.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	КомпоновщикНастроекРезультата.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);
	НастройкиРезультата = КомпоновщикНастроекРезультата.ПолучитьНастройки();

	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиРезультат, НастройкиРезультата, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаРезультата", ТаблицаРезультата);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);
	
	ПроцессорВыводаРезультатаКомпоновкиДанных = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВыводаРезультатаКомпоновкиДанных.УстановитьДокумент(ДокументРезультат);
	ПроцессорВыводаРезультатаКомпоновкиДанных.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецФункции
